prep for service/client restructuring
